## Plan Result (prod_ai - TerraformPlanApply)




<pre><code>Plan: 26 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.cognitive_account_primary_access_key
  * azurerm_key_vault_secret.cognitive_account_secondary_access_key
  * azurerm_resource_group.rg
  * azurerm_role_assignment.poc_group
  * module.ai.azurerm_ai_foundry.ai_foundry
  * module.ai.azurerm_ai_foundry_project.ai_foundry_project
  * module.ai.azurerm_cognitive_account.cognitive_account
  * module.ai.azurerm_machine_learning_compute_cluster.compute_cluster
  * module.ai.azurerm_machine_learning_workspace.ml_workspace
  * module.ai.azurerm_private_endpoint.cognitive_private_endpoint
  * module.ai.azurerm_private_endpoint.foundry_private_endpoint
  * module.ai.azurerm_private_endpoint.ml_private_endpoint
  * module.ai.azurerm_role_assignment.blob_contributor_from_cognitive_account
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.key_vault.azurerm_key_vault.kv
  * module.key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.key_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.storage.azapi_update_resource.defender_settings
  * module.storage.azurerm_private_endpoint.this[0]
  * module.storage.azurerm_storage_account.storage_account
  * module.storage.random_string.storage_account_random_string
  * module.storage.time_rotating.rotate
  * module.storage.time_static.pim_expiry
  * module.storage.time_static.pim_start




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.cognitive_account_primary_access_key will be created
  + resource "azurerm_key_vault_secret" "cognitive_account_primary_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "cognitive-account-primary-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.cognitive_account_secondary_access_key will be created
  + resource "azurerm_key_vault_secret" "cognitive_account_secondary_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "cognitive-account-secondary-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dlrm-ingest-ai-prod"
      + tags     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # azurerm_role_assignment.poc_group will be created
  + resource "azurerm_role_assignment" "poc_group" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a0e75592-f51f-46c3-84ef-df609b08eb68"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_ai_foundry.ai_foundry will be created
  + resource "azurerm_ai_foundry" "ai_foundry" {
      + discovery_url                = (known after apply)
      + high_business_impact_enabled = (known after apply)
      + id                           = (known after apply)
      + key_vault_id                 = (known after apply)
      + location                     = "uksouth"
      + name                         = "dlrm-ingest-ai-foundry-prod"
      + public_network_access        = "Enabled"
      + resource_group_name          = "dlrm-ingest-ai-prod"
      + storage_account_id           = (known after apply)
      + tags                         = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + workspace_id                 = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + managed_network {
          + isolation_mode = "AllowInternetOutbound"
        }
    }

  # module.ai.azurerm_ai_foundry_project.ai_foundry_project will be created
  + resource "azurerm_ai_foundry_project" "ai_foundry_project" {
      + ai_services_hub_id           = (known after apply)
      + high_business_impact_enabled = (known after apply)
      + id                           = (known after apply)
      + location                     = "uksouth"
      + name                         = "dlrm-ingest-project-prod"
      + project_id                   = (known after apply)
      + tags                         = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.ai.azurerm_cognitive_account.cognitive_account will be created
  + resource "azurerm_cognitive_account" "cognitive_account" {
      + custom_subdomain_name              = "dlrm-ingest-cognitive-account-prod"
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "FormRecognizer"
      + local_auth_enabled                 = true
      + location                           = "uksouth"
      + name                               = "dlrm-ingest-cognitive-account-prod"
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = true
      + resource_group_name                = "dlrm-ingest-ai-prod"
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "F0"
      + tags                               = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.ai.azurerm_machine_learning_compute_cluster.compute_cluster will be created
  + resource "azurerm_machine_learning_compute_cluster" "compute_cluster" {
      + id                            = (known after apply)
      + local_auth_enabled            = true
      + location                      = "uksouth"
      + machine_learning_workspace_id = (known after apply)
      + name                          = "dlrm-ingest-compute-cluster-prod"
      + node_public_ip_enabled        = true
      + ssh_public_access_enabled     = false
      + subnet_resource_id            = (known after apply)
      + vm_priority                   = "LowPriority"
      + vm_size                       = "Standard_DS2_v2"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + scale_settings {
          + max_node_count                       = 1
          + min_node_count                       = 0
          + scale_down_nodes_after_idle_duration = "PT30S"
        }
    }

  # module.ai.azurerm_machine_learning_workspace.ml_workspace will be created
  + resource "azurerm_machine_learning_workspace" "ml_workspace" {
      + application_insights_id       = (known after apply)
      + discovery_url                 = (known after apply)
      + id                            = (known after apply)
      + key_vault_id                  = (known after apply)
      + kind                          = "Default"
      + location                      = "uksouth"
      + name                          = "dlrm-ingest-ml-workspace-prod"
      + public_network_access_enabled = true
      + resource_group_name           = "dlrm-ingest-ai-prod"
      + sku_name                      = "Basic"
      + storage_account_id            = (known after apply)
      + tags                          = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + v1_legacy_mode_enabled        = false
      + workspace_id                  = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + managed_network {
          + isolation_mode = "AllowInternetOutbound"
        }
    }

  # module.ai.azurerm_private_endpoint.cognitive_private_endpoint will be created
  + resource "azurerm_private_endpoint" "cognitive_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-cognitive-account-pe-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-ai-prod"
      + subnet_id                = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-prod"
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.cognitiveservices.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "cognitive-account-psc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "account",
            ]
        }
    }

  # module.ai.azurerm_private_endpoint.foundry_private_endpoint will be created
  + resource "azurerm_private_endpoint" "foundry_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-ai-foundry-pe-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-ai-prod"
      + subnet_id                = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-prod"
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ai-foundry-psc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "amlworkspace",
            ]
        }
    }

  # module.ai.azurerm_private_endpoint.ml_private_endpoint will be created
  + resource "azurerm_private_endpoint" "ml_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrm-ingest-ml-workspace-pe-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-ai-prod"
      + subnet_id                = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-prod"
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ml-workspace-psc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "amlworkspace",
            ]
        }
    }

  # module.ai.azurerm_role_assignment.blob_contributor_from_cognitive_account will be created
  + resource "azurerm_role_assignment" "blob_contributor_from_cognitive_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "dlrm-ingest-ai-appinsights-prod"
      + resource_group_name                   = "dlrm-ingest-ai-prod"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + workspace_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application Insights daily cap reached - dlrm-ingest-ai-appinsights-prod"
      + resource_group_name = "dlrm-ingest-ai-prod"
      + scopes              = (known after apply)
      + tags                = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + action {
          + action_group_id    = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actiongroups/sds-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = null
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)

          + resource_health (known after apply)

          + service_health (known after apply)
        }
    }

  # module.key_vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "dlrm-ingest-ai-kv-prod"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "dlrm-ingest-ai-prod"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.key_vault.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "fa819da1-65df-4a0b-8a9d-ff970a473216"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key_vault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + name                           = "dlrm-ingest-ai-kv-prod"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "AuditEvent"
            # (1 unchanged attribute hidden)
        }
    }

  # module.storage.azapi_update_resource.defender_settings will be created
  + resource "azapi_update_resource" "defender_settings" {
      + body                    = {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "current"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.Security/DefenderForStorageSettings@2022-12-01-preview"
    }

  # module.storage.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "dlrmingestaisaprod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dlrm-ingest-ai-prod"
      + subnet_id                = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-prod"
      + tags                     = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dlrmingestaisaprod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.storage.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "dlrmingestaisaprod"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "dlrm-ingest-ai-prod"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + blob_properties (known after apply)

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/aks-00",
            ]
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.storage.random_string.storage_account_random_string will be created
  + resource "random_string" "storage_account_random_string" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.storage.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage.time_static.pim_expiry will be created
  + resource "time_static" "pim_expiry" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

  # module.storage.time_static.pim_start will be created
  + resource "time_static" "pim_start" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 26 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":66,"Program":"tfcmt","SHA1":"","Target":"prod_ai - TerraformPlanApply","Vars":{}} -->